# 1. Дано целое число K. Вывести строку-описание оценки, соответствующей числу K
# (1 — «плохо», 2 — «неудовлетворительно», 3 — «удовлетворительно», 4 — «хорошо», 5 — «отлично»).
# Если K не лежит в диапазоне 1–5, то вывести строку «ошибка».
k = int(input('Введите число: '))

if k == 1:
    result = "плохо"
elif k == 2:
    result = "неудовлетворительно"
elif k == 3:
    result = "удовлетворительно"
elif k == 4:
    result = "хорошо"
elif k == 5:
    result = "отлично"
else:
    result = "ошибка"

print(result)


# 2. Дан номер месяца — целое число в диапазоне 1–12 (1 — январь, 2 — февраль и т. д.).
# Определить количество дней в этом месяце для невисокосного года.
month = input('\nВведите месяц: ')

if month in [1, 3, 5, 7, 8, 10, 12]:
    print(f'31 день')
elif month in [4, 6, 9, 11]:
    print(f'30 дней')
elif month == 2:
    print(f'28 дней')
else:
    print(f'Ошибка')

# 3. Даны два целых числа: D (день) и M (месяц), определяющие правильную дату невисокосного года.
# Вывести значения D и M для даты, следующей за указанной.
day = input('\nВведите день: ')
month = input('Введите месяц: ')
if month in [1, 3, 5, 7, 8, 10, 12]:
    days_in_month = 31
elif month in [4, 6, 9, 11]:
    days_in_month = 30
elif month == 2:
    days_in_month = 28

if day < days_in_month:
    print(f'{day + 1} день - {month} месяц')
else:
    if month == 12:
        print('1 день - 1 месяц')
    else:
        print(f'1 день - {month + 1} месяц')


# 4. Робот может перемещаться в четырех направлениях («С» — север, «З» — запад, «Ю» — юг, «В» — восток)
# и принимать три цифровые команды: 0 — продолжать движение, 1 — поворот налево, −1 — поворот направо.
# Дан символ C — исходное направление робота и целое число N — посланная ему команда.
# Вывести направление робота после выполнения полученной команды.

current_direction = input('\nВведите направление: ').upper()
command = int(input('Введите команду: '))
directions = ['N', 'E', 'S', 'W']
index = directions.index(current_direction)

if command == 0:
    print('Продолжаю движение')
elif command == 1:
    index = (index - 1) % 4
    print(f'Повернули на {directions[index]}')
elif command == -1:
    index = (index + 1) % 4
    print(f'Повернули на {directions[index]}')

# 5. Дано целое число в диапазоне 100–999.
# Вывести строку-описание данного числа, например:
# 256 — «двести пятьдесят шесть», 814 — «восемьсот четырнадцать».

number = int(input('\nВведите число: '))

hundreds = {
    1: "сто", 2: "двести", 3: "триста", 4: "четыреста",
    5: "пятьсот", 6: "шестьсот", 7: "семьсот",
    8: "восемьсот", 9: "девятьсот"
}

tens = {
    2: "двадцать", 3: "тридцать", 4: "сорок",
    5: "пятьдесят", 6: "шестьдесят",
    7: "семьдесят", 8: "восемьдесят", 9: "девяносто"
}

teens = {
    10: "десять", 11: "одиннадцать", 12: "двенадцать", 13: "тринадцать",
    14: "четырнадцать", 15: "пятнадцать", 16: "шестнадцать",
    17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать"
}

units = {
    1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять",
    6: "шесть", 7: "семь", 8: "восемь", 9: "девять"
}

hundred = number // 100
ten = (number % 100) // 10
unit = number % 10

result = hundreds[hundred]

if ten == 1:
    result += " " + teens[10 + unit]
else:
    if ten > 1:
        result += " " + tens[ten]
    if unit > 0:
        result += " " + units[unit]

print(result)

# 6.

first_number = float(input("\nВведите первое число: "))
operation = input("Введите операцию (+, -, *, /): ")
second_number = float(input("Введите второе число: "))

if operation == '+':
    result = first_number + second_number
elif operation == '-':
    result = first_number - second_number
elif operation == '*':
    result = first_number * second_number
elif operation == '/':
    if second_number != 0:
        result = first_number / second_number
    else:
        result = "Ошибка: Деление на ноль!"
else:
    result = "Ошибка: Неверная операция!"

print("Результат:", result)

